kauailabs/navxmxp/stm32/navx-mxp/navx-mxp_hal.c
void HAL_IOCX_AssertInterruptSignal()
{
	/* Assert Interrupt Pin */
#if 0 /* TODO:  Enable once VMX-pi w/additional INT pins is ready. */
	uint32_t curr_gpio_outdata = *int_request_gpio_bank;
	*int_request_gpio_bank = curr_gpio_outdata | int_request_bit;
#endif
}

/* Todo:  For performance, inline and move these to header file. */
void HAL_IOCX_AssertInterrupt(uint32_t new_int_status_bits)
{
	/* Mask out any current-disabled bits */
	/* If any bits remain: */
	/*   Set the specified bits in the interrupt status */
	/*   If Interrupt Pin is not Asserted */
	/*     Assert the Interrupt Pin */
	int_status |= new_int_status_bits;
	if (int_status & int_mask) {
		HAL_IOCX_AssertInterruptSignal();
	}
}

void HAL_IOCX_DeassertInterruptSignal()
{
#if 0 /* TODO:  Enable once VMX-pi w/additional INT pins is ready. */
	uint32_t curr_gpio_outdata = *int_request_gpio_bank;
	*int_request_gpio_bank = curr_gpio_outdata & ~int_request_bit;
#endif
}

void HAL_IOCX_DeassertInterrupt(uint32_t int_bits_to_clear) {
	int_status &= ~int_bits_to_clear;
	if (!(int_status & int_mask)) {
		HAL_IOCX_DeassertInterruptSignal();
	}
}

void HAL_IOCX_UpdateInterruptMask(uint32_t int_bits) {
	int_mask = int_bits;
	/* If all actively assert interrupts are now masked    */
	/* then deassert the interrupt signal, and vice versa. */
	if(!(int_status & int_mask)) {
		HAL_IOCX_DeassertInterruptSignal();
	} else {
		HAL_IOCX_AssertInterruptSignal();
	}
	/* Todo:  Disable SoftwareEdgeDetector if none are masked in? */
	/* TOdo:  use mask in GPIO EXTI ISRs to avoid unnecessary dispatch */
}

static void ConfigureSoftwareEdgeDetector(int gpio_channel_index,
										  IOCX_GPIO_INTERRUPT interrupt_mode)
{
	if (!p_edge_detector) return;
	if (gpio_channel_index >= IOCX_NUM_GPIOS) return;

	int gpio_interrupt_index = gpio_channels[gpio_channel_index].interrupt_index;

	int i;
	uint32_t gpio_int_status_bit = 1 << gpio_interrupt_index;
	for (i = 0; i < edge_detector_count; i++) {
		if(p_edge_detector[i].interrupt_bit == gpio_int_status_bit) {
			p_edge_detector[i].interrupt_mode = interrupt_mode;
			break;
		}
	}
}

/* Note:  This function is invoked from a high-priority (Sys Tick) ISR.    */
/* Thus, it must be performant, and must protect against unsafe re-entrant */
/* behavior.  Someday it might even be re-written in assembly language!    */
void HAL_IOCX_DetectGPIOEdges()
{
	int i;
	uint32_t modified_int_status = 0;

	if (!(int_mask & SWED_INTERRUPT_BIT_MASK)) return;

	for (i = 0; i < edge_detector_count; i++) {
		SoftwareEdgeDetector *p_detector = &p_edge_detector[i];
		uint32_t curr_masked_data = *(p_detector->p_GpioInputDataReg) & p_detector->gpio_input_mask;
		if (curr_masked_data != p_detector->last_masked_data) {
			/* Change detected */
			uint32_t interrupt_mode = p_detector->interrupt_mode;
			if((interrupt_mode == GPIO_INTERRUPT_BOTH_EDGES) ||
			   ((interrupt_mode == GPIO_INTERRUPT_RISING_EDGE) && (curr_masked_data)) ||
			   ((interrupt_mode == GPIO_INTERRUPT_FALLING_EDGE) && (!curr_masked_data))) {
				/* Desired Edge detected */
				if(int_mask & p_detector->interrupt_bit) {
					/* This interrupt bit is masked in */
					modified_int_status |= p_detector->interrupt_bit;
				}
			}
			p_detector->last_masked_data = curr_masked_data;
		}
	}
	if (modified_int_status) {
		HAL_IOCX_AssertInterrupt(modified_int_status);
	}
}

uint32_t HAL_IOCX_GetInterruptMask() {
	return int_mask;
}

uint32_t HAL_IOCX_GetInterruptStatus() {
	return int_status;
}

/***************************************************************************/
/* Timer section                                                           */
/*                                                                         */
/* Each timer is clocked off of either APB1 or APB2, as follows:           */
/*                                                                         */
/* APB1 Timer Clocks:  24Mhz (TIM2, TIM3, TIM4, TIM5)					   */
/* APB2 Timer Clocks:  96Mhz (TIM1, TIM9, TIM10, TIM11)					   */
/*																		   */
/* To keep things uniform, all 96Mhz clock sources use an internal         */
/* (/4) divider - thus all clocks operate at a clock frequency (fTIM) of   */
/* 24Mhz.                                                                  */
/***************************************************************************/

TIM_HandleTypeDef htim1 = {TIM1};
TIM_HandleTypeDef htim2 = {TIM2};
TIM_HandleTypeDef htim3 = {TIM3};
TIM_HandleTypeDef htim4 = {TIM4};
TIM_HandleTypeDef htim5 = {TIM5};
TIM_HandleTypeDef htim9 = {TIM9};

//#ifdef ENABLE_PWM_GENERATION
typedef struct {
	TIM_HandleTypeDef *p_tim_handle;
	uint32_t core_clock_divider;
	uint32_t first_channel_number;
	uint32_t second_channel_number;
} Timer_Config;

#define TIMER_CLOCK_FREQUENCY 24000000
#define TIMER_TICKS_PER_MICROSECOND (TIMER_CLOCK_FREQUENCY/1000000)

static Timer_Config timer_configs[IOCX_NUM_TIMERS] =
{
	{&htim1, TIM_CLOCKDIVISION_DIV4, TIM_CHANNEL_1, TIM_CHANNEL_2},
	{&htim2, TIM_CLOCKDIVISION_DIV1, TIM_CHANNEL_1, TIM_CHANNEL_2},
	{&htim3, TIM_CLOCKDIVISION_DIV1, TIM_CHANNEL_1, TIM_CHANNEL_2},
	{&htim4, TIM_CLOCKDIVISION_DIV1, TIM_CHANNEL_1, TIM_CHANNEL_2},
	{&htim5, TIM_CLOCKDIVISION_DIV1, TIM_CHANNEL_3, TIM_CHANNEL_4},
	{&htim9, TIM_CLOCKDIVISION_DIV4, TIM_CHANNEL_1, TIM_CHANNEL_2},
};

uint16_t timer_channel_ccr[IOCX_NUM_TIMERS][IOCX_NUM_CHANNELS_PER_TIMER];

//#endif

void HAL_IOCX_GPIO_Set_Config(uint8_t gpio_index, uint8_t config) {

	if ( gpio_index > (IOCX_NUM_GPIOS-1) ) return;

	IOCX_GPIO_TYPE type = iocx_decode_gpio_type(&config);
	IOCX_GPIO_INPUT input = iocx_decode_gpio_input(&config);
	IOCX_GPIO_INTERRUPT interrupt_mode = iocx_decode_gpio_interrupt(&config);

	GPIO_InitTypeDef GPIO_InitStruct;
	GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
	GPIO_InitStruct.Pin = gpio_channels[gpio_index].pin;

	switch(type){
	case GPIO_TYPE_INPUT:
		GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
		/* Enable the Pin as Input */
		switch(input){
		default:
		case GPIO_INPUT_FLOAT:
			GPIO_InitStruct.Pull = GPIO_NOPULL;
			break;
		case GPIO_INPUT_PULLUP:
			GPIO_InitStruct.Pull = GPIO_PULLUP;
			break;
		case GPIO_INPUT_PULLDOWN:
			GPIO_InitStruct.Pull = GPIO_PULLDOWN;
			break;
		}
		if(gpio_channels[gpio_index].interrupt_type == INT_EXTI) {
			switch(interrupt_mode) {
			case GPIO_INTERRUPT_RISING_EDGE:
				GPIO_InitStruct.Mode |= GPIO_MODE_IT_RISING;
				break;
			case GPIO_INTERRUPT_FALLING_EDGE:
				GPIO_InitStruct.Mode |= GPIO_MODE_IT_FALLING;
				break;
			case GPIO_INTERRUPT_BOTH_EDGES:
				GPIO_InitStruct.Mode |= GPIO_MODE_IT_RISING_FALLING;
				break;
			case GPIO_INTERRUPT_DISABLED:
				break;
			}
		} else if ( gpio_channels[gpio_index].interrupt_type == INT_SWED) {
			ConfigureSoftwareEdgeDetector(gpio_index, interrupt_mode);
		}
		break;
	case GPIO_TYPE_OUTPUT_PUSHPULL:
		GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
		break;
	case GPIO_TYPE_OUTPUT_OPENDRAIN:
		GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
		break;
	case GPIO_TYPE_AF:
		if ( gpio_channels[gpio_index].alt_function <= MAX_VALID_STM32_AF_VALUE ) {
			GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
			GPIO_InitStruct.Alternate = gpio_channels[gpio_index].alt_function;
		} else {
			GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
			GPIO_InitStruct.Pull = GPIO_PULLDOWN; // ???
			// TODO:  Enable Interrupt if alt_function == GPIO_AF_SW_RESET_COUNTER
			// TODO:  Enable Software function
		}
		/* TODO:  If the timer is running, stop it? */
		/* TODO:  If the timer was stopped above, restart it? */
		break;
	case GPIO_TYPE_DISABLED:
	default:
		// TODO:  If a software alternate function, disable that function
		HAL_GPIO_DeInit(gpio_channels[gpio_index].p_gpio, GPIO_InitStruct.Pin);
		return;
	}
	HAL_GPIO_Init(gpio_channels[gpio_index].p_gpio, &GPIO_InitStruct);
}

void HAL_IOCX_GPIO_Get(uint8_t first_gpio_index, int count, uint8_t *values)
{
	int i;
	if ( first_gpio_index > (IOCX_NUM_GPIOS-1) ) return;
	if ( first_gpio_index + count > IOCX_NUM_TIMERS) {
		count = IOCX_NUM_TIMERS - first_gpio_index;
	}
	for ( i = first_gpio_index; i < first_gpio_index + count; i++ ) {
		*values = (HAL_GPIO_ReadPin(gpio_channels[i].p_gpio, gpio_channels[i].pin) == GPIO_PIN_SET) ?
			IOCX_GPIO_SET : IOCX_GPIO_RESET;
	}
}

void HAL_IOCX_GPIO_Set(uint8_t gpio_index, uint8_t value)
{
	if ( gpio_index > (IOCX_NUM_GPIOS-1) ) return;
    HAL_GPIO_WritePin( gpio_channels[gpio_index].p_gpio, gpio_channels[gpio_index].pin,
    		(value != IOCX_GPIO_RESET) ? GPIO_PIN_SET : GPIO_PIN_RESET);
}

void HAL_IOCX_TIMER_Enable_Clocks(uint8_t timer_index, int enable)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;

	switch(timer_index){
	case 0: enable ? __TIM1_CLK_ENABLE() : __TIM1_CLK_DISABLE(); break;
	case 1: enable ? __TIM2_CLK_ENABLE() : __TIM2_CLK_DISABLE(); break;
	case 2: enable ? __TIM3_CLK_ENABLE() : __TIM3_CLK_DISABLE(); break;
	case 3: enable ? __TIM4_CLK_ENABLE() : __TIM4_CLK_DISABLE(); break;
	case 4: enable ? __TIM5_CLK_ENABLE() : __TIM5_CLK_DISABLE(); break;
	case 5: enable ? __TIM9_CLK_ENABLE() : __TIM9_CLK_DISABLE(); break;
	}
}

#define BOTH_ENCODER_TIMER_CHANNELS 0xFF /*(TIM_CHANNEL_1 and TIM_CHANNEL_2)*/

void HAL_IOCX_TIMER_Set_Config(uint8_t timer_index, uint8_t config)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;

	IOCX_TIMER_MODE mode = iocx_decode_timer_mode(&config);
	IOCX_QUAD_ENCODER_MODE qe_mode = iocx_decode_quad_encoder_mode(&config);
	switch(mode){
	case TIMER_MODE_DISABLED:
		// TODO:  IF was in PWM Mode, stop PWM?
		// TODO:  IF was in QEMode, stop QE?
		__HAL_TIM_DISABLE(timer_configs[timer_index].p_tim_handle);
		break;

	case TIMER_MODE_QUAD_ENCODER:
		{
			TIM_Encoder_InitTypeDef sConfig;
			TIM_MasterConfigTypeDef sMasterConfig;

